# One hot encoding for categorical variable (creating dummy variable)

In [1]:
import pandas as pd
data={
    'ID':[1,2,3,4,5],
    'City':['New york','London','Paris','New york','Paris'],
    'Gender':['Male','Female','Female','Male','Male',]
}
df_sample1=pd.DataFrame(data)
print('orginal Dataset:')
print(df_sample1)

orginal Dataset:
   ID      City  Gender
0   1  New york    Male
1   2    London  Female
2   3     Paris  Female
3   4  New york    Male
4   5     Paris    Male

In [15]:
dataset_encoded=pd.get_dummies(df_sample1,columns=['City','Gender'],drop_first=True).astype(int)
dataset_encoded

   ID  City_New york  City_Paris  Gender_Male
0   1              1           0            1
1   2              0           0            0
2   3              0           1            0
3   4              1           0            1
4   5              0           1            1

In [21]:
dataset_encoded2=pd.get_dummies(df_sample1,columns=['City','Gender'],drop_first=False).astype(int)
dataset_encoded2

   ID  City_London  City_New york  City_Paris  Gender_Female  Gender_Male
0   1            0              1           0              0            1
1   2            1              0           0              1            0
2   3            0              0           1              1            0
3   4            0              1           0              0            1
4   5            0              0           1              0            1